/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isdigit.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: danjimen <danjimen@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/23 14:04:15 by danjimen          #+#    #+#             */
/*   Updated: 2024/06/28 08:27:43 by danjimen         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//Verifica si un carácter es un dígito numérico.
int	ft_isdigit(int c)
{
	if (c >= '0' && c <= '9')
		return (1);
	else
		return (0);
}
